; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Prodigy blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain prodigy-bw)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (on-table ?x)
	       (clear ?x)
	       (arm-empty)
	       (holding ?x)
	       )
  (:action pick-up
	     :parameters (?ob1)
	     :precondition (and (clear ?ob1) (on-table ?ob1) (arm-empty))
	     :effect
	     (and (not (on-table ?ob1))
		   (not (clear ?ob1))
		   (not (arm-empty))
		   (holding ?ob1)))
  (:action put-down
	     :parameters (?ob)
	     :precondition (holding ?ob)
	     :effect
	     (and (not (holding ?ob))
		   (clear ?ob)
		   (arm-empty)
		   (on-table ?ob)))
  (:action stack
	     :parameters (?sob ?sunderob)
	     :precondition (and (holding ?sob) (clear ?sunderob))
	     :effect
	     (and (not (holding ?sob))
		   (not (clear ?sunderob))
		   (clear ?sob)
		   (arm-empty)
		   (on ?sob ?sunderob)))
  (:action unstack
	     :parameters (?sob ?sunderob)
	     :precondition (and (on ?sob ?sunderob) (clear ?sob) (arm-empty))
	     :effect
	     (and (holding ?sob)
		   (clear ?sunderob)
		   (not (clear ?sob))
		   (not (arm-empty))
		   (not (on ?sob ?sunderob)))))

; problem
(define (problem bw-sussman)       ; graphplan 6 steps
    (:domain prodigy-bw)
  (:objects A B C)
  (:init (on-table a) (on-table b) (on c a)
		(clear b) (clear c) (arm-empty))
  (:goal (and (on a b) (on b c))))

; plan
1. (unstack c a)
   deleted: (clear c) (arm-empty) (on c a)
   added: (holding c) (clear a)
   goals met: 0 of 2
2. (put-down c)
   deleted: (holding c)
   added: (clear c) (arm-empty) (on-table c)
   goals met: 0 of 2
3. (pick-up b)
   deleted: (on-table b) (clear b) (arm-empty)
   added: (holding b)
   goals met: 0 of 2
4. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (arm-empty) (on b c)
   goals met: 1 of 2
5. (pick-up a)
   deleted: (on-table a) (clear a) (arm-empty)
   added: (holding a)
   goals met: 1 of 2
6. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (arm-empty) (on a b)
   goals met: 2 of 2
